Repository: jfrank98/amov-flutter
Catalog: weather/lib/l10n/intl_*.arb
Languages: pt

# pageHomeConfirm
source: Confirm
pt: Confirmar

# pageHomeWelcome
source: Welcome {name}
pt: Bem vindo {name}

# pageHomeWelcomeGender
source: {gender, select, male {Hi man!} female {Hi woman!} other {Hi there!}}
pt: {gender, select, male {Boas mano!} female {Boas mana!} other {Boas pessoa!}}

# pageHomeWelcomeRole
source: {role, select, admin {Hi admin!} manager {Hi manager!} other {Hi visitor!}}
pt: {role, select, admin {Boas admin!} manager {Boas gestor!} other {Boas visitante!}}

# pageNotificationsCount
source: {howMany, plural, one{1 message} other{{howMany} messages}}
pt: {howMany, plural, one{1 mensagem} other{{howMany} mensagens}}

# pageCurrentTemperature
source: Current temperature: {temp}
pt: Temperature atual: {temp}

# pageFeelsLike
source: Feels like: {feelsLike}
pt: Sensação: {feelsLike}

# pageMaxTemp
source: Max. temperature: {maxTemp}
pt: Temperatura máxima: {maxTemp}

# pageMinTemp
source: Min. temperature: {minTemp}
pt: Temperature mínima: {minTemp}

# pageRefreshWeatherData
source: Refresh
pt: Atualizar

# pageDaily
source: Daily
pt: Diariamente

# pageHourly
source: Hourly
pt: Por hora

# pageReturnToMain
source: Return to main page
pt: Voltar à página principal

# pageSunrise
source: Sunrise: {sunrise}
pt: Nascer do sol: {sunrise}

# pageSunset
source: Sunset: {sunset}
pt: Pôr do sol: {sunset}

# pageMoonrise
source: Moonrise: {moonrise}
pt: Nascer da lua: {moonrise}

# pageMoonset
source: Moonset: {moonset}
pt: Pôr da lua: {moonset}

# pageLastUpdate
source: Last updated: {updateTime}
pt: Ultima atualização: {updateTime}

# pageForecastTime
source: Forecast time: {forecast}
pt: Previsão feita às: {forecast}
